xtrgt = input("Введите Х цели: ")
ytrgt = input("Введите У цели: ")

print ("------------------------------------------")

xwpn = input("Введите Х ОП: ")
ywpn = input("Введите У ОП: ")

print ("------------------------------------------")

x1 = int(xtrgt) - int(xwpn)
y1 = int(ytrgt) - int(ywpn)

if abs(x1) < abs(y1):
    print (x1 / y1, "Коэффициент направления")
    print ("------------------------------------------")
if abs(x1) > abs(y1):
    print (y1 / x1, "Коэффициент направления")
    print ("------------------------------------------")

if abs(x1) < abs(y1):
    print (x1, "МРК", y1, "БРК")
    print ("------------------------------------------")
if abs(x1) > abs(y1):
    print (y1, "МРК", x1, "БРК")
    print ("------------------------------------------")

if x1 > 0 and x1 > y1 and y1 > 0:
    print ("+Δy / +∆x")
    print ("Найди данное выражение в таблице Кравченко")
    
if x1 > 0 and x1 < y1 and y1 > 0:
	print ("+∆x / +∆y")
	print ("Найди данное выражение в таблице Кравченко")

if x1 < 0 and x1 < y1 and y1 < 0:
	print ("-∆y / -∆x")
	print ("Найди данное выражение в таблице Кравченко")

if x1 < 0 and x1 > y1 and y1 < 0:
	print ("-∆x / -∆y")
	print ("Найди данное выражение в таблице Кравченко")

if abs(x1) > abs(y1) and x1 > 0 and y1 < 0:
	print ("-∆y / +∆x")
	print ("Найди данное выражение в таблице Кравченко")

if abs(x1) < abs(y1) and x1 > 0 and y1 < 0:
	print ("+∆x / -∆y")
	print ("Найди данное выражение в таблице Кравченко")

if abs(x1) > abs(y1) and x1 < 0 and y1 > 0:
	print ("+∆y / -∆x")
	print ("Найди данное выражение в таблице Кравченко")

if abs(x1) < abs(y1) and x1 < 0 and y1 > 0:
	print ("-∆x / +∆y")
	print ("Найди данное выражение в таблице Кравченко")



input ()